# 方式一
# 写文件
# 1.打开文件
"""
f = open("F:/python的学习/2026/2026.6.2/3.文件写入.txt","w",encoding="utf-8") # w:写入模式,如果文件不存在会自动创建,如果文件存在会覆盖原有内容

try:
    # 2.写入文件内容
    f.write("静夜思(李白)\n")
    f.write("床前明月光，\n")
    f.write("疑是地上霜。\n")
    f.write("举头望明月，\n")
    f.write("低头思故乡。\n")

finally:
    # 3.关闭文件
    f.close()
"""

# 方式二:最佳实践
with open("F:/python的学习/2026/2026.6.2/3.文件写入.txt","w",encoding="utf-8") as f: # w:写入模式,如果文件不存在会自动创建,如果文件存在会覆盖原有内容

# 2.写入文件内容
    f.write("静夜思(李白)\n")
    f.write("床前明月光，\n")
    f.write("疑是地上霜。\n")
    f.write("举头望明月，\n")
    f.write("低头思故乡。\n")

# 3.关闭文件
f.close()

# 提示:with语句(上下文管理器)的核心作用就是确保资源的总是被正确获取和释放(即使发生异常,也会被正确释放),也是项目开发中的推荐模式