# if条件判断基本格式
# if 要判断的条件(判断语句的结果,必须是布尔类型True或False,True会执行if内的代码,False则不会执行):
#      条件成立时,要执行对应的操作
# Python中是通过缩进来描述代码归属的,归属于if代码的语句,需要在前方缩进4个空格

# 案例: 如果我的高考分数超过680,我就去读清华
# 定义变量
score = 685
# 条件判断
if score > 680:
    print("欢迎你,来清华读书\n也恭喜你即将踏入精彩的校园生活")

# 案例: 输入账号密码后登录B站
# 需求:
# 结合前面学习的输入输出及if条件判断的知识，完成B站登录功能的实现(正确账号和密码为18888888888/666888)
# 正确的账号和密码
ok_account = "18888888888"
ok_password = "666888"

# 1.接收用户输入账号和密码
account = input("请输入您的账号:")
password = input("请输入您的密码:")
# input返回的永远是字符串

# 2.判断账号和密码是否全部正确,如果都正确,则登录成功,进入B站首页
if account == ok_account and password == ok_password:
    print("登陆成功~\n进入B站首页")

# 3.判断账号和密码是否有错误的,如果有任何一个错误,则登陆失败,提示错误信息
if account != ok_account or password != ok_password:
    print("登陆失败~\n账号或密码错误")