# 传参方式指的是,在调用函数时,传递实参的方式
# 1.位置参数:调用函数时根据函数定义时的位置来传递参数
# 要求:调用函数时参数顺序与定义函数时参数顺序完全一致
# 2.关键字参数:调用函数时以函数定义时形参名称作为关键字,以"键=值"的形式来传递参数(不要求顺序)
# 要求:如果位置参数与关键字参数混用,关键字参数必须在位置参数之后(关键字参数之间,没有顺序要求)

# 定义函数
def reg_stu(name,age,gender,city):
    print(f"注册成功,姓名:{name},年龄:{age},性别:{gender},城市:{city}")
    return {"name":name,"age":age,"gender":gender,"city":city}

# 传参方式一:位置参数
stu = reg_stu("张三", 18, "男", "北京")
print(stu)

# 传参方式二:关键字参数
stu = reg_stu(name="王林", age=28, gender="男", city="北京")
print(stu)

stu = reg_stu(age=20, gender="女", city="北京",name="李慕婉")
print(stu)

# 传参方式三:位置参数 + 关键字参数 ---> 位置参数在前,关键字参数在后
stu = reg_stu("李慕婉",20, gender="女", city="北京")
print(stu)

# 位置参数                           关键字参数
# 优点:简洁                     可读性强 易维护和扩展
# 缺点:可读性差 易出错 维护难          代码繁琐
# 场景:参数少(不超过三个),且顺序自然  参数较多,或易混淆的场景