# 组包(Packing):将多个值合并到一个容器(元组 列表)中
# 解包(Unpacking):将容器(元组 列表)解开成独立的元素,分别赋值给多个变量

# 定义元组,组包
t1 = (5,7,9,1)
# 定义元组,组包
t2 = 5,7,9,1

# 基础解包
a,b,c,d = t1

# (*)扩展解包
x,*y,z = t2 # x为5,y为[7,9],z为1
s,*o = t2 # s为5,o为[7,9,1]
*o,e = t2 # o为[5,7,9],e为1
# 说明:在元组解包时,*表示收集剩余的所有元素,允许我们处理不确定数量的元素(生成列表,以便于可以进一步的处理)

t1 = (5,7,9,10,2,23,12)
t2 = 5,7,9,10,2,23,12

print(t1)
print(t2)

# 解包操作
# 基础解包(变量数量与容器的元素个数一致)
a,b,c,d,e,f,g = t1
print(a,b,c,d,e,f,g)

# * 扩展解包(* 收集剩余的所有元素,封装列表list中)
first,second,*other,last = t1
print(first,second,other,last)

*other,last2,last1 = t1
print(other,last2,last1)

# 案例1:现在有两个变量,分别为: a = 10,b = 20,现需要将这两个变量值交换,然后输出到控制台
a = 10
b = 20

# 组包
t = b,a
# 解包
a,b = t 

# 可以合并到一行 a,b = b,a

print(a,b)

# 案例2:现有三个变量,分别为: a = 100,b = 200,c = 300,现需要将这三个变量值进行交换,将a,b,c的值分别赋值给c,a,b,并将其输出到控制台

a = 100
b = 200
c = 300

# 组包与解包操作
c,a,b = a,b,c

print(a)
print(b)
print(c)