# 算数运算符
# 运算符   描述   举例说明
#   +     加法   1 + 5 : 1加5
#   -     剑法   8 - 3 : 8减3
#   *     乘法   3 * 8 : 3乘以8
#   /     除法   10 / 5 : 10除以5,除法结果是小数
#   //    整除   10 // 3 : 10整除3,整整除结果为整数
#   %     取余/求模  10 % 3 : 10模于3,结果为1(10除3取余数)
#   **    幂指数  10 ** 3 : 10的3次方
print("10 + 4 =",10 + 4) # 加
print("10 - 4 =",10 - 4) # 减
print("10 * 4 =",10 * 4) # 乘
print("10 / 4 =",10 / 4) # 除
print("10 // 4 =",10 // 4) # 整除(结果为整数)
print("10 % 4 =",10 % 4) # 取余/求模
print("10 ** 4 =",10 ** 4) # 幂指数

# 算数运算符的优先级 --> ** --> * / // % --> + -
print("0.1 + 10 / 4 ** 2=",0.1 + 10 / 4 ** 2)

# 案例: 要求输入两个数x与y,分别输出x + y的结果和x - y的结果
# float(..) ---> 将其他类型 转为 浮点数类型
x = float(input("请输入x的值:"))
y = float(input("请输入y的值:"))

# 0.999999998 ---> 精度损失 ; 由于计算机底层是基于 二进制 进行数据的存储与处理,而二进制是无法准确的表示所有小数,因此涉及到浮点数的运算,可能会损失精度
print("x + y = ",x + y)
print("x - y = ",x - y)

# 练习:
# 案例1:计算输入的三个整数的平均数
# 案例2:要求输入梯形的上底、下底、高，然后计算梯形的面积
# 案例3:要求输入圆的半径，然后计算圆的周长和面积(周长:2πr，面积:πr2)
# 案例4:身体质量指数BMI的计算(BMI=体重(kg)/身高(m)2)
# 1.输入体重(单位kg)
# 2.输入身高(单位m)
# 3.计算身体质量指数BMI并输出 

# 案例1:
num1 = int(input("请输入第一个值:"))
num2 = int(input("请输入第二个值:"))
num3 = int(input("请输入第三个值:"))
print("三个数字的平均值为:",(num1 + num2 + num3) / 3)
# 也可以这样 avg_data = (num1 + num2 + num3) / 3
# print(f"{num1}, {num2}, {num3} 这三个数的平均数为: {avg_data}")

# 案例2:
shang_di = float(input("请输入梯形的上底长度:"))
xia_di = float(input("请输入梯形下底的长度:"))
h = float(input("请输入梯形的高:"))
print("梯形的面积是:",(shang_di + xia_di) * h / 2)
# print(f"梯形的面积是: {(shang_di + xia_di) * h / 2}")

# 案例3:
r = float(input("请输入圆的半径:"))
print("圆的周长是:",2 * 3.14 * r)
print("圆的面积是:",3.14 * r ** 2)
# print(f"圆的周长是: {2 * 3.14 * r}")
# print(f"圆的面积是: {3.14 * r ** 2}")

# 案例4:1.
weight = float(input("请输入体重(单位kg): "))
height = float(input("请输入身高(单位m): "))
print("bmi:",weight / height ** 2)
# bmi = weight / height ** 2
# print(f"BMI: {bmi}")