# 通过 %占位符 的形式完成字符串和变量的快速拼接(其中 % 表示我要占位, s 表示将变量转为字符串放入占位的位置)

s1 = "人机"
print("大家好,我是%s,欢迎大家进入Python课程的学习"%s1)

s2 = "人生苦短"
s3 = "我用Python"
print("%s说:%s,%s"%(s1,s2,s3))
# 前面有多少个占位符 % ,后面就需要有多少个变量(或数据),前后数量需一致

# 字符串格式化 ---> 方式一: %s 占位符
name = ".."
age = 18
pro = ".."
hobby = "Python"
print("大家好,我是" + name + "," "今年" + str(age) + "岁,学习的专业是" + pro + ",爱好" + hobby)
print("大家好,我是%s,今年%s岁,学习的专业是%s,爱好%s"%(name,age,pro,hobby))

# 也可以通过 f"内容{变量/表达式}"的形式来完成快速格式化(推荐)
name = "人机"
print(f"大家好,我是{name},欢迎大家进入Python课程的学习")
print(f"{s1}说:{s2},{s3}")

# 字符串格式化 ---> 方式二: f"..{变量名/表达式}.." ---> 推荐方式
name = ".."
age = 18
pro = ".."
hobby = "Python"
print(f"大家好,我是{name},今年{age}岁,学习的专业是{pro},爱好{hobby}")