# 需求1：输入一个字符串, 判断该字符串是否是回文(两边对称)
s = input("请输入一个字符串: ")

# 方式一(双指针法):思路是从两边向中间遍历,基于索引获取两边字符对比,如果两边的字符不相等,则不是回文,否则是回文
# 1. 输入一个字符串, 判断该字符串是否是回文(两边对称) 。  "黄山落叶松叶落山黄"  "上海自来水来自海上"
s = input("请输入一个字符串: ")

# 方式一(双指针法): 思路是从两边向中间遍历, 基于索引获取两边字符对比, 如果两边的字符不相等, 则不是回文, 否则是回文。
left = 0 #  左索引
right =  len(s) - 1 # 右索引
flag = True

while left < right:
    if s[left] != s[right]:
        flag = False
        break
    left += 1
    right -= 1

if flag:
    print(f"'{s}' 是回文")
else:
    print(f"'{s}' 不是回文")


# 方式二:
if s == s[::-1]:
    print(f"'{s}' 是回文")
else:
    print(f"'{s}' 不是回文")

# 需求2：将用户输入的10个字符串, 反转后全部转换为大写, 然后记录在列表中, 最后将列表内容，遍历输出出来。
s_list = []

for i in range(10):
    s = input("请输入一个字符串: ")
    s_list.append(s[::-1].upper())
print("输入的字符串列表为:", s_list)

print("--------------------------------")

print("反转后的字符串列表为:")
for s in s_list:
    print(s)

# 3.输入一个字符串，完成以下操作：
# (1).输出它的长度
# (2).输出全部转成大写的结果
# (3).输出全部转成小写的结果
# (4).输出去掉首尾空格后的结果
# (1).
s = input("请输入字符串：")
print("长度：", len(s))
# (2).
print("大写：", s.upper())
# (3).
print("小写：", s.lower())
# (4).
print("去空格后：", s.strip())

# 4.输入任意字符串，统计里面：
# (1).字母 a（不区分大小写）出现了多少次
# (2).空格出现了多少次
# (1).
s = input("请输入字符串:")
print("字母 a 出现的次数：", s.lower().count("a"))
# (2).
print("空格出现的次数：", s.count(" "))

# 5.输入一个字符串,判断它是不是回文（正读和反读一样,比如 level、abba）
# 输出:是回文 或 不是回文
s = input("请输入一个字符串: ")
if s == s[::-1]:
    print(f"'{s}' 是回文")
else:
    print(f"'{s}' 不是回文")

# 6.输入一个混合了字母和数字的字符串(比如 abc123def456),把里面所有的数字字符提取出来,组成一个新的字符串并输出
# 示例:输入:abc123def456 输出:123456
s = input("请输入一个混合了字母和数字的字符串: ")
new_s = ""
for char in s:
    if char.isdigit(): # isdigit() 方法用于判断字符串是否只包含数字字符,如果是数字字符,返回True;否则,返回False
        new_s += char
print("提取出来的数字字符串为:", new_s)

# 7.输入一个句子,把里面的敏感词 bad 替换成 ***,然后输出替换后的句子
# 示例:输入:this is bad word输出:this is *** word
s = input("请输入一个句子: ")
s = s.replace("bad", "***")
print("替换后的句子为:", s)

# 8.输入一个字符串,输出它的反转结果
# 示例:输入:hello输出:olleh
s = input("请输入一个字符串: ")
print("反转后的字符串为:", s[::-1])